[
    {
      "id": 1,
      "nombre": "Freezer",
      "valor": 500,
      "descuento": true,
      "porcentaje_descuento": 10,
      "image": "https://cdn.hobbyconsolas.com/sites/navi.axelspringer.es/public/media/image/2023/05/dragon-ball-z-fin-lanzara-nueva-figura-oficial-freezer-sangre-censura-3041560.jpg?tf=3840x",
      "type": "villano",
      "stock": 1,
      "descripcion": "Freezer es un tirano intergaláctico y el emperador del Universo 7. Es un ser de una raza extraterrestre llamada los 'Frieza' y posee una fuerza destructiva incomparable. Freezer es conocido por su crueldad despiadada y su deseo de dominación universal. Ha sido uno de los enemigos más formidables a los que se han enfrentado los Guerreros Z, y su sed de poder lo ha llevado a cometer innumerables actos atroces en su búsqueda por alcanzar la supremacía."
    },
    {
      "id": 2,
      "nombre": "Cell",
      "valor": 450,
      "descuento": false,
      "porcentaje_descuento": 0,
      "image": "https://i5.walmartimages.com/seo/14-75-Dragon-Ball-Z-Son-Goku-Perfect-Cell-Action-Figure_a764faad-beac-4d33-b806-3ef2ba38c9ba.185b68c34bf4787ccac6079af79156ce.jpeg",
      "type": "villano",
      "stock": 2,
      "descripcion": "Cell es un bio-androide creado por el Dr. Gero con células de los mejores luchadores del universo, incluyendo a Goku, Vegeta y Freezer. Cell es una criatura formidable que posee una habilidad de regeneración casi ilimitada y la capacidad de absorber a otros seres para aumentar su propio poder. Su objetivo final es alcanzar su forma perfecta y desatar su verdadero potencial destructivo sobre el mundo. Es uno de los villanos más complejos y peligrosos que los Guerreros Z han enfrentado, representando una amenaza tanto física como estratégica."
    },
    {
      "id": 3,
      "nombre": "Majin Buu",
      "valor": 600,
      "descuento": true,
      "porcentaje_descuento": 15,
      "image": "https://startz.cl/wp-content/uploads/2022/06/973970107-1536514849.jpg",
      "type": "villano",
      "stock": 1,
      "descripcion": "Majin Buu es una entidad rosa con una capacidad de regeneración casi ilimitada y un apetito insaciable por la destrucción. Originalmente creado por el hechicero Bibidi, Buu es un ser caótico y impredecible que ha sembrado el caos en el universo durante milenios. A lo largo de la historia, Buu ha sido liberado en varias ocasiones, desatando su poder destructivo sin restricciones. Sin embargo, a medida que la historia avanza, Buu experimenta cambios significativos, mostrando diferentes aspectos de su personalidad y demostrando que incluso los seres más malvados pueden encontrar redención."
    },
    {
      "id": 4,
      "nombre": "Cell Jr.",
      "valor": 200,
      "descuento": true,
      "porcentaje_descuento": 20,
      "image": "https://i5.walmartimages.com.mx/mg/gm/3pp/asr/cf88748e-dbf5-4e78-b290-9a24f37c5e5b.cc50b53a1c45698c05613d6054e1ed4e.jpeg?odnHeight=612&odnWidth=612&odnBg=FFFFFF",
      "type": "villano",
      "stock": 4,
      "descripcion": "Los Cell Juniors son versiones diminutas de Cell, creadas a partir de células de su propio cuerpo. Aunque son más pequeños en estatura, poseen una fuerza y velocidad formidables, haciéndolos oponentes peligrosos para los Guerreros Z. Los Cell Juniors fueron liberados durante la batalla final de Cell, y cada uno fue asignado para luchar contra un miembro específico del equipo de Goku. A pesar de su tamaño, demostraron ser desafíos significativos para los héroes, poniendo a prueba su habilidad y resistencia en combate."
    },
    {
      "id": 5,
      "nombre": "Babidi",
      "valor": 150,
      "descuento": false,
      "porcentaje_descuento": 0,
      "image": "https://i.ebayimg.com/images/g/aogAAOSwoN5kxLrY/s-l1600.jpg",
      "type": "villano",
      "stock": 5,
      "descripcion": "Babidi es un hechicero malvado y el hijo de Bibidi, el creador original de Majin Buu. Su objetivo es resucitar a Majin Buu y utilizarlo para conquistar el universo. Para lograr esto, Babidi utiliza su magia oscura para controlar a varios luchadores poderosos y manipularlos para que hagan su voluntad. Aunque físicamente débil, Babidi posee un intelecto astuto y una determinación despiadada, lo que lo convierte en un enemigo formidable para los Guerreros Z."
    },
    {
      "id": 6,
      "nombre": "Tao Pai Pai",
      "valor": 250,
      "descuento": true,
      "porcentaje_descuento": 25,
      "image": "https://cdnx.jumpseller.com/avso-toyz-store/image/21530094/6f316ffee0aa42a3a2c8dae7656127c7xl.jpg?1659652040",
      "type": "villano",
      "stock": 2,
      "descripcion": "Tao Pai Pai, también conocido como Mercenary Tao, es un asesino a sueldo y uno de los luchadores más mortales del mundo. Es contratado por el ejército Red Ribbon para eliminar a Goku y obtener las Esferas del Dragón. Tao Pai Pai es conocido por su habilidad de vuelo, su destreza en combate y su implacable naturaleza asesina. A lo largo de su carrera, ha derrotado a numerosos oponentes con facilidad, ganándose una reputación temible en todo el mundo."
    },
    {
      "id": 9,
      "nombre": "Raditz",
      "valor": 200,
      "descuento": true,
      "porcentaje_descuento": 15,
      "image": "https://m.media-amazon.com/images/I/81+B4vpp5YL.jpg",
      "type": "villano",
      "stock": 2,
      "descripcion": "Raditz es el hermano mayor de Goku y uno de los últimos supervivientes de la raza Saiyan. Aparece por primera vez en la serie como un villano que viene a la Tierra para reclutar a Goku para unirse a la fuerza invasora de los Saiyan. Aunque su tiempo en la serie es breve, Raditz deja una impresión duradera como el primer enemigo verdadero de Goku después de su entrenamiento con el Maestro Roshi. Su llegada desencadena una serie de eventos que llevan al descubrimiento de la verdadera identidad y origen de Goku."
    },
    {
      "id": 10,
      "nombre": "Nappa",
      "valor": 250,
      "descuento": true,
      "porcentaje_descuento": 20,
      "image": "https://m.media-amazon.com/images/I/81dPxCZflAL.jpg",
      "type": "villano",
      "stock": 4,
      "descripcion": "Nappa es un guerrero Saiyan y el compañero de batalla de Vegeta. Junto con Vegeta, Nappa llega a la Tierra con la intención de encontrar y destruir a Goku. Es un guerrero brutal y despiadado que no duda en usar la fuerza letal contra sus enemigos. Durante su tiempo en la Tierra, Nappa causa una gran cantidad de destrucción y caos antes de ser derrotado por los Guerreros Z. Aunque su papel en la serie es relativamente breve, Nappa es recordado como uno de los primeros y más formidables oponentes de Goku y sus amigos."
    },
    {
        "id": 11,
        "nombre": "Bulma",
        "valor": 350,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://falabella.scene7.com/is/image/Falabella/gsc_114141840_898252_1?wid=800&hei=800&qlt=70",
        "type": "personaje",
        "stock": 5,
        "descripcion": "Bulma es una brillante científica e inventora, así como uno de los personajes principales de Dragon Ball. Es conocida por su inteligencia, ingenio y determinación. Desde el comienzo de la serie, Bulma ha desempeñado un papel crucial al proporcionar tecnología y apoyo logístico a los Guerreros Z en su búsqueda de las Esferas del Dragón y en la lucha contra diversas amenazas. A lo largo de los años, su relación con Vegeta ha evolucionado desde una asociación incómoda hasta un amor duradero, y juntos tienen una familia."
      },
      {
        "id": 12,
        "nombre": "Milk",
        "valor": 300,
        "descuento": true,
        "porcentaje_descuento": 10,
        "image": "https://cdnx.jumpseller.com/avso-toyz-store/image/40692117/4.jpg?1696976483",
        "type": "personaje",
        "stock": 3,
        "descripcion": "Milk, también conocida como Chi-Chi, es la esposa de Goku y la madre de Gohan y Goten. Aunque no posee habilidades de combate extraordinarias como los Guerreros Z, Milk es una figura maternal fuerte y protectora que valora la educación y el bienestar de su familia. A lo largo de la serie, se preocupa por la seguridad de Goku y sus hijos, instándolos a que se centren en sus responsabilidades domésticas y educativas en lugar de pasar todo su tiempo entrenando para pelear."
      },
      {
        "id": 13,
        "nombre": "Maestro Roshi",
        "valor": 400,
        "descuento": true,
        "porcentaje_descuento": 15,
        "image": "https://cdnx.jumpseller.com/cosplayfan/image/41239123/bp88402_frente.jpg?1697998542",
        "type": "personaje",
        "stock": 4,
        "descripcion": "El Maestro Roshi, también conocido como Kame-Sen'nin, es un legendario maestro de artes marciales y uno de los personajes más ancianos y sabios de Dragon Ball. Aunque su comportamiento pervertido y su amor por las revistas para adultos pueden ocultar su verdadera sabiduría, el Maestro Roshi es un luchador formidable con décadas de experiencia. Ha entrenado a varios de los Guerreros Z, incluyendo a Goku y Krilin, y su influencia ha sido crucial en su desarrollo como luchadores y como personas."
      },
      {
        "id": 14,
        "nombre": "Oolong",
        "valor": 200,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://http2.mlstatic.com/D_NQ_NP_625095-MLC53533107015_012023-O.webp",
        "type": "personaje",
        "stock": 5,
        "descripcion": "Oolong es un cerdo antropomórfico con habilidades de transformación limitadas y un comportamiento cobarde. A pesar de su apariencia cómica, Oolong ha desempeñado un papel importante en varias aventuras de los Guerreros Z, proporcionando información útil y apoyo logístico en situaciones de crisis. Aunque a menudo se muestra como un personaje egoísta y centrado en sí mismo, Oolong ha demostrado tener un corazón bondadoso y está dispuesto a ayudar a sus amigos cuando más lo necesitan."
      },
      {
        "id": 15,
        "nombre": "Puar",
        "valor": 200,
        "descuento": true,
        "porcentaje_descuento": 25,
        "image": "https://cdn.wallapop.com/images/10420/fa/r5/__/c10420p925055242/i3424121387.jpg?pictureSize=W320",
        "type": "personaje",
        "stock": 4,
        "descripcion": "Puar es un pequeño gato antropomórfico y compañero de Oolong. Al igual que Oolong, Puar tiene la capacidad de transformarse, aunque su habilidad es más limitada en comparación. A lo largo de la serie, Puar es un amigo leal y compañero de aventuras para los Guerreros Z, proporcionando apoyo moral y ocasionalmente interviniendo en situaciones peligrosas para ayudar a sus amigos. Aunque a menudo es retratado como tímido y nervioso, Puar demuestra ser valiente cuando la situación lo requiere."
      },
      {
        "id": 16,
        "nombre": "Launch",
        "valor": 250,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://tiendaotakuplace.com/wp-content/uploads/2021/03/lanch-24cm-25-dolares.jpg",
        "type": "personaje",
        "stock": 3,
        "descripcion": "Launch es un personaje único que sufre de un trastorno de personalidad que causa que cambie de personalidad cada vez que estornuda. En su forma tranquila, es una mujer rubia amable y tranquila. Sin embargo, cuando estornuda, se transforma en una mujer morena agresiva y violenta. A pesar de su naturaleza impredecible, Launch se une a los Guerreros Z en varias ocasiones y demuestra ser una luchadora capaz y valiente, aunque su papel en la serie disminuye con el tiempo."
      },
      {
        "id": 17,
        "nombre": "Mr. Satan",
        "valor": 350,
        "descuento": true,
        "porcentaje_descuento": 10,
        "image": "https://www.mirax.cl/productos/n220001a230000/n228001a229000/n228001a228100/g228032.jpg",
        "type": "personaje",
        "stock": 2,
        "descripcion": "Mr. Satan, también conocido como Hercule en la versión en inglés, es un luchador de artes marciales autoproclamado y una figura pública famosa en el mundo de Dragon Ball. Aunque carece de habilidades sobrenaturales como los Guerreros Z, Mr. Satan es conocido por su carisma, astucia y habilidades de relaciones públicas. A lo largo de la serie, se le presenta como un personaje cómico y vanidoso, pero también muestra valentía y determinación cuando se enfrenta a enemigos poderosos."
      },
      {
        "id": 18,
        "nombre": "Videl",
        "valor": 300,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://http2.mlstatic.com/D_NQ_NP_743102-MLC49272943755_032022-O.webp",
        "type": "personaje",
        "stock": 4,
        "descripcion": "Videl es la hija de Mr. Satan y una luchadora de artes marciales talentosa en su propio derecho. Aunque inicialmente es escéptica respecto a las habilidades de lucha de los Guerreros Z, Videl se convierte en una aliada valiosa después de descubrir la verdadera identidad de Gohan como el Gran Saiyaman. A lo largo de la serie, Videl demuestra ser una luchadora hábil y valiente, dispuesta a poner su vida en peligro para proteger a sus seres queridos y defender lo que cree que es correcto."
      },
      {
        "id": 19,
        "nombre": "Bills",
        "valor": 500,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://falabella.scene7.com/is/image/Falabella/gsc_123971551_3804053_1?wid=1500&hei=1500&qlt=70",
        "type": "personaje",
        "stock": 3,
        "descripcion": "Bills es el Dios de la Destrucción del Universo 7 y uno de los personajes más poderosos de Dragon Ball. Aunque es técnicamente una entidad divina, Bills no es un villano en el sentido tradicional, ya que su papel es mantener el equilibrio cósmico destruyendo planetas y sistemas solares cuando se considera necesario. Aunque su poder es abrumador, Bills es un ser de carácter impredecible, a veces mostrando un comportamiento infantil y otras veces actuando con sabiduría y calma."
      },
      {
        "id": 20,
        "nombre": "Whis",
        "valor": 550,
        "descuento": true,
        "porcentaje_descuento": 10,
        "image": "https://www.figuritasde.com/wp-content/uploads/2020/06/26-DB-Super-Whis.jpg",
        "type": "personaje",
        "stock": 4,
        "descripcion": "Whis es el asistente personal y maestro de Bills, así como uno de los seres más poderosos del universo. Aunque su apariencia y comportamiento son en general serenos y corteses, Whis posee un poder increíble que lo coloca muy por encima de la mayoría de los seres en el universo de Dragon Ball. Además de su papel como sirviente de Bills, Whis también actúa como mentor de Goku y Vegeta, entrenándolos en el arte de la lucha y proporcionando sabiduría sobre los secretos del universo."
      },
      {
        "id": 21,
        "nombre": "Goku Base",
        "valor": 500,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://http2.mlstatic.com/D_NQ_NP_820862-MLU71652616644_092023-O.webp",
        "transformacion": "Base",
        "type": "guerrero",
        "stock": 5,
        "descripcion": "Goku en su forma base, con su apariencia y poder normales."
      },
      {
        "id": 22,
        "nombre": "Goku Super Saiyan",
        "valor": 550,
        "descuento": true,
        "porcentaje_descuento": 10,
        "image": "https://tienda.richirocko.com/wp-content/uploads/2021/04/619280.jpg",
        "transformacion": "Super Saiyan",
        "type": "guerrero",
        "stock": 3,
        "descripcion": "Goku en su forma Super Saiyan, caracterizada por su cabello dorado y un aumento significativo en su poder."
      },
      {
        "id": 23,
        "nombre": "Goku Super Saiyan 2",
        "valor": 600,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://http2.mlstatic.com/D_NQ_NP_679815-MLC72990506175_112023-O.webp",
        "transformacion": "Super Saiyan 2",
        "type": "guerrero",
        "stock": 4,
        "descripcion": "Goku en su forma Super Saiyan 2, una evolución de su estado Super Saiyan que proporciona un aumento aún mayor en su poder y velocidad."
      },
      {
        "id": 24,
        "nombre": "Goku Super Saiyan 3",
        "valor": 700,
        "descuento": true,
        "porcentaje_descuento": 15,
        "image": "https://falabella.scene7.com/is/image/Falabella/14450721_1?wid=800&hei=800&qlt=70",
        "transformacion": "Super Saiyan 3",
        "type": "guerrero",
        "stock": 2,
        "descripcion": "Goku en su forma Super Saiyan 3, una transformación que se caracteriza por un cabello largo y dorado y un poder abrumador."
      },
      {
        "id": 25,
        "nombre": "Goku Super Saiyan God",
        "valor": 750,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://cdnx.jumpseller.com/avso-toyz-store/image/41704359/resize/900/900?1699055004",
        "transformacion": "Super Saiyan God",
        "type": "guerrero",
        "stock": 3,
        "descripcion": "Goku en su forma Super Saiyan God, obtenida mediante el ritual del Super Saiyan God. Esta forma le otorga un poder divino y una apariencia distintiva con cabello rojo y ojos azules."
      },
      {
        "id": 26,
        "nombre": "Goku Super Saiyan Blue",
        "valor": 800,
        "descuento": true,
        "porcentaje_descuento": 10,
        "image": "https://cdnx.jumpseller.com/cosplayfan/image/30264343/a52bab51-5851-42e9-9454-c59a5f0b9866.jpg?1671109474",
        "transformacion": "Super Saiyan Blue",
        "type": "guerrero",
        "stock": 4,
        "descripcion": "Goku en su forma Super Saiyan Blue, una combinación del poder del Super Saiyan God con la forma Super Saiyan. Esta transformación le otorga un poder increíble y una apariencia de cabello azul."
      },
      {
        "id": 27,
        "nombre": "Vegeta Base",
        "valor": 500,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://geekz.cl/web/image/product.template/18676/image",
        "transformacion": "Base",
        "type": "guerrero",
        "stock": 5,
        "descripcion": "Vegeta en su forma base, con su apariencia y poder normales."
      },
      {
        "id": 28,
        "nombre": "Vegeta Super Saiyan",
        "valor": 550,
        "descuento": true,
        "porcentaje_descuento": 10,
        "image": "https://cdnx.jumpseller.com/cosplayfan/image/41240170/bp19716_frente.jpg?1698005340",
        "transformacion": "Super Saiyan",
        "type": "guerrero",
        "stock": 3,
        "descripcion": "Vegeta en su forma Super Saiyan, una transformación que le otorga un poder considerable y un cabello dorado característico."
      },
      {
        "id": 29,
        "nombre": "Vegeta Super Saiyan 2",
        "valor": 600,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://meccha-japan.com/45669-large_default/figure-majin-vegeta-super-saiyan-2-dragonball.jpg",
        "transformacion": "Super Saiyan 2",
        "type": "guerrero",
        "stock": 4,
        "descripcion": "Vegeta en su forma Super Saiyan 2, una evolución de su estado Super Saiyan que le proporciona un poder aún mayor y una apariencia más intensa."
      },
      {
        "id": 30,
        "nombre": "Vegeta Super Saiyan Blue",
        "valor": 800,
        "descuento": "https://www.aniplay.cl/img/productos/483/dragon-ball-super-the-vegeta-maximatic-i-banpresto.jpg",
        "porcentaje_descuento": 10,
        "image": "https://geekz.cl/web/image/product.template/18334/image",
        "transformacion": "Super Saiyan Blue",
        "type": "guerrero",
        "stock": 4,
        "descripcion": "Vegeta en su forma Super Saiyan Blue, una transformación que combina el poder del Super Saiyan God con la forma Super Saiyan. Esta forma le otorga un poder increíble y una apariencia de cabello azul."
      },
      {
        "id": 31,
        "nombre": "Gohan Base",
        "valor": 400,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://geekz.cl/web/image/product.template/5778/image",
        "transformacion": "Base",
        "type": "guerrero",
        "stock": 5,
        "descripcion": "Gohan en su forma base, con su apariencia y poder normales."
      },
      {
        "id": 32,
        "nombre": "Gohan Adolescente",
        "valor": 450,
        "descuento": true,
        "porcentaje_descuento": 10,
        "image": "https://entrefiguras.com/wp-content/uploads/figura-son-gohan-chico-zokei-ekiden-return-trip-banpresto.jpg",
        "transformacion": "Adolescente",
        "type": "guerrero",
        "stock": 3,
        "descripcion": "Gohan en su etapa adolescente, una vez crecido pero antes de su entrenamiento con el Supremo Kaio. En esta etapa, Gohan ya ha demostrado su potencial como guerrero."
      },
      {
        "id": 33,
        "nombre": "Gohan Super Saiyan",
        "valor": 500,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://m.media-amazon.com/images/I/71+cGc4+evL.jpg",
        "transformacion": "Super Saiyan",
        "type": "guerrero",
        "stock": 4,
        "descripcion": "Gohan en su forma Super Saiyan, una transformación que le otorga un poder considerable y un cabello dorado característico."
      },
      {
        "id": 34,
        "nombre": "Gohan Super Saiyan 2",
        "valor": 550,
        "descuento": true,
        "porcentaje_descuento": 15,
        "image": "https://cdnx.jumpseller.com/avso-toyz-store/image/38810698/resize/900/900?1692926690",
        "transformacion": "Super Saiyan 2",
        "type": "guerrero",
        "stock": 2,
        "descripcion": "Gohan en su forma Super Saiyan 2, una evolución de su estado Super Saiyan que le proporciona un poder aún mayor y una apariencia más intensa."
      },
      {
        "id": 35,
        "nombre": "Gohan Adulto Super Saiyan",
        "valor": 600,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://irion.cl/wp-content/uploads/2023/05/01_4983164192766_03.jpg",
        "transformacion": "Adulto Super Saiyan",
        "type": "guerrero",
        "stock": 3,
        "descripcion": "Gohan como adulto en su forma Super Saiyan, continuando su legado como un guerrero poderoso."
      },
      {
        "id": 36,
        "nombre": "Piccolo",
        "valor": 450,
        "descuento": true,
        "porcentaje_descuento": 10,
        "image": "https://4.bp.blogspot.com/-8xE6NC7XdGo/VAs127IfiQI/AAAAAAAAoec/ucxkOA8xDMw/s1600/Piccolo%2B05.jpg",
        "type": "guerrero",
        "stock": 3,
        "descripcion": "Piccolo, también conocido como Piccolo Daimaoh, es un Namekiano y uno de los luchadores más poderosos de la Tierra. Anteriormente fue un enemigo de Goku pero después se convirtió en un aliado valioso, luchando junto a los Guerreros Z para proteger el planeta de diversas amenazas."
      },
      {
        "id": 37,
        "nombre": "Krillin",
        "valor": 400,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://falabella.scene7.com/is/image/Falabella/113917769_1?wid=800&hei=800&qlt=70",
        "type": "guerrero",
        "stock": 5,
        "descripcion": "Krillin es uno de los amigos más cercanos de Goku y uno de los luchadores más experimentados de los Guerreros Z. Aunque no posee el mismo nivel de poder que Goku o Vegeta, Krillin es extremadamente valiente y hábil en combate, participando en numerosas batallas para proteger a la Tierra."
      },
      {
        "id": 38,
        "nombre": "Yamcha",
        "valor": 380,
        "descuento": true,
        "porcentaje_descuento": 15,
        "image": "https://images.stockx.com/images/Bandai-Ichiban-Kuji-Dragon-Ball-History-of-Rivals-Yamcha-Action-Figure-Orange.jpg?fit=fill&bg=FFFFFF&w=700&h=500&fm=webp&auto=compress&q=90&dpr=2&trim=color&updated_at=1633449959",
        "type": "guerrero",
        "stock": 2,
        "descripcion": "Yamcha es un antiguo ladrón del desierto convertido en un poderoso luchador y miembro de los Guerreros Z. Aunque a menudo se burla de sus derrotas en combate, Yamcha es un luchador valiente y ha demostrado su dedicación a proteger a sus amigos y al planeta Tierra."
      },
      {
        "id": 39,
        "nombre": "Ten Shin Han",
        "valor": 420,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://http2.mlstatic.com/D_NQ_NP_876984-MLC28781965331_112018-O.webp",
        "type": "guerrero",
        "stock": 4,
        "descripcion": "Ten Shin Han Shinhan, a menudo simplemente llamado Ten Shin Han, es un poderoso luchador humano y un miembro leal de los Guerreros Z. Con una historia de entrenamiento riguroso y participación en torneos de artes marciales, Ten Shin Han es conocido por su fuerza y habilidades únicas en combate."
      },
      {
        "id": 40,
        "nombre": "Chaoz",
        "valor": 350,
        "descuento": true,
        "porcentaje_descuento": 20,
        "image": "https://cdn.shopify.com/s/files/1/0399/1833/8203/products/figura-dragon-ball-chaoz.jpg?v=1616834043",
        "type": "guerrero",
        "stock": 3,
        "descripcion": "Chaoz es un pequeño y poderoso humano psíquico y uno de los aliados más antiguos de Ten Shin Han Shinhan. Aunque no es tan combativo como otros miembros de los Guerreros Z, Chaoz ha demostrado ser un amigo leal dispuesto a ayudar en cualquier situación."
      },
      {
        "id": 41,
        "nombre": "Yajirobe",
        "valor": 320,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://ae01.alicdn.com/kf/S9e3f58bdc6c443a7b6fa8aa9f3c70ef9t.jpg_640x640Q90.jpg_.webp",
        "type": "guerrero",
        "stock": 5,
        "descripcion": "Yajirobe es un humano perezoso pero valiente que vive en las montañas y se convierte en un aliado ocasional de los Guerreros Z. Aunque prefiere evitar el combate siempre que sea posible, Yajirobe ha demostrado ser capaz de luchar cuando la situación lo requiere."
      },
      {
        "id": 43,
        "nombre": "Goten",
        "valor": 450,
        "descuento": true,
        "porcentaje_descuento": 10,
        "image": "https://http2.mlstatic.com/D_NQ_NP_797023-MLC54904558545_042023-O.webp",
        "type": "guerrero",
        "stock": 3,
        "descripcion": "Goten es el segundo hijo de Goku y Chi-Chi, y el hermano menor de Gohan. Aunque todavía es joven e inexperto en el combate, Goten muestra un gran potencial como luchador y ha demostrado ser capaz de transformarse en Super Saiyan a una edad temprana."
      },
      {
        "id": 44,
        "nombre": "Trunks del Futuro",
        "valor": 480,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://irion.cl/wp-content/uploads/2023/03/Captura-de-pantalla-2023-03-24-a-las-12.09.12.png",
        "type": "guerrero",
        "stock": 2,
        "descripcion": "Trunks del Futuro, también conocido como Mirai Trunks, es el hijo de Vegeta y Bulma en una línea de tiempo alternativa devastada por los androides. Aunque su vida ha sido difícil, Trunks del Futuro se convierte en un guerrero valiente y poderoso, luchando para proteger lo que queda de la humanidad."
      },
      {
        "id": 45,
        "nombre": "Android 18",
        "valor": 550,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://http2.mlstatic.com/D_NQ_NP_855506-MLC71564218344_092023-O.webp",
        "type": "guerrero",
        "stock": 4,
        "descripcion": "Android 18, originalmente llamada Lazuli, es uno de los androides creados por el Dr. Gero para destruir a los Guerreros Z. Sin embargo, después de ser liberada de su control, Android 18 se convierte en una aliada valiosa, luchando junto a los Guerreros Z para proteger la Tierra."
      },
      {
        "id": 46,
        "nombre": "Android 17",
        "valor": 550,
        "descuento": false,
        "porcentaje_descuento": 0,
        "image": "https://www.kametoys.cl/wp-content/uploads/2022/05/SHF-ANDROID-17-UNIVERSE-SURVIVAL_04.jpg",
        "type": "guerrero",
        "stock": 4,
        "descripcion": "Android 17, originalmente conocido como Lapis, es el hermano gemelo de Android 18 y otro de los androides creados por el Dr. Gero. Aunque inicialmente fue un enemigo de los Guerreros Z, Android 17 se redime y se convierte en un guardián del parque nacional después de ser revivido."
      }
]